{"/javazrFA25/about/":{"data":{"":"","#":"Remember who you are. PhD Architect. Associate Professor at the University of A Coruña in the field of structures in the degree of Architectural Studies. Member of the Architectural Structures Research Group.\nTeaching in the field of structures in qualifications leading to the practice of the regulated professions of Architect and Technical Architect, as well as in the University Master’s Degree in building rehabilitacion and in the BIM Master’s Degree at UDC, among other non-official degrees.\nIntegrated in the Architectural Structures Research Group. 6 research patents. Coordinator of the Digital Manufacturing Workshop of ETSAC, OFabdaETSAC.\nI have taught and organized numerous courses in parametric design and digital manufacturing, as well as courses at different levels of training in BIM processes under the Autodesk Revit platform. Support technician certified by Autodesk for the AEC sector from 1995 to 2011 in the AutoCAD platform and from 2009 to 2011 in the BIM Revit platform.\nAutodesk certified professional for the BIM Revit Architecture 2015 platform.\nFab Academy Student Agreement"},"title":"About"},"/javazrFA25/assignments/week-1/":{"data":{"#":"This is my first week at FabAcademy.\nEncabezado 1Encabezado 4 Esto es una cita","encabezado-1#Encabezado 1":""},"title":"Week 1"},"/javazrFA25/assignments/week-2/":{"data":{"":"This is my second week at FabAcademy."},"title":"Week 2"},"/javazrFA25/docs/":{"data":{"":"This is a demo of the theme’s documentation layout.\nNot used"},"title":"Documentation"},"/javazrFA25/docs/commands/":{"data":{"":"","#":"Tips for maintenance "},"title":"Commands"},"/javazrFA25/docs/commands/abouthextra/":{"data":{"":"","configuration#Configuration":"Top right menu under is define under the menu.main section in the config file: hugo.yaml","footer#Footer":"I must create a file called i18n/en.yam","images#Images":"I have decided to place the images under the static folder ","layouts#Layouts":"Three layouts for diferent content types:\ndocs content/docs Structured information\nblog content/assigments For publish the work done each week. With listing and detailed article views\nblog content/FinalDiary\ndefault All other directories Single-page article view without sidebar","organize-files#Organize files":"Organize files By default, Hugo searches for Markdown files in the content directory and the structure of this directory determines the final output structure. Here is my proposal:\n📦content\n┣ 📂assignments\n┃ ┣ 📂week-1\n┃ ┃ ┗ 📜_index.md\n┃ ┣ 📂week-2\n┃ ┃ ┗ 📜_index.md\n┃ ┣ 📂week-x\n┃ ┃ ┗ 📜_index.md\n┃ ┗ 📜_index.md\n┣ 📂docs\n┃ ┣ 📂Commands\n┃ ┃ ┣ 📜AboutHextra.md\n┃ ┃ ┗ 📜_index.md\n┃ ┣ 📜first-page.md\n┃ ┣ 📜StudentAgreement.md\n┃ ┗ 📜_index.md\n┣ 📂FinalDiary\n┃ ┣ 📂FinalProject\n┃ ┃ ┗ 📜_index.md\n┃ ┗ 📜_index.md\n┣ 📜about.md\n┗ 📜_index.md"},"title":"About Hextra Theme"},"/javazrFA25/docs/studentagreement/":{"data":{"":"The Fab Academy is responsible for:\nTeaching principles and practices of digital fabrication Arranging lectures, recitations, meetings, and events for the class Evaluating and providing feedback on student work Offering clear standards for completing assignments Certifying and archiving student progress Supervising class preparation Reviewing prospective students, instructors, and labs Providing central staff and infrastructure for students, instructors, and labs Fund-raising for costs not covered by student tuition Managing and reporting on the program’s finances, results, and impacts Publicizing the program Promoting a respectful environment free of harassment and discrimination Encourage a diverse, accessible, and equitable community I am a Fab Academy student, responsible for:\nAttending class lectures and participating in reviews Developing and documenting projects assigned to introduce and demonstrate skills, in enough detail to be able to reproduce them Honestly reporting on my work, and appropriately attributing the work of others (both human and machine, including AI prompts) Being prepared to answer questions about my work Allowing the Fab Academy to share my work (with attribution) in the class for purposes compatible with its mission Working safely Leaving workspaces in the same (or better) condition than I found them Participating in the upkeep of my lab Ensuring that my tuition for local and central class costs is covered Following locally applicable health and safety guidance Recognizing limits on lab and staff time Promoting a respectful environment free of harassment and discrimination Signed by committing this file in my repository,\nPepe Vázquez"},"title":"Fab Academy Student Agreement"},"/javazrFA25/finaldiary/":{"data":{"":"","#":"here we go!! "},"title":"Final Project Plan \u0026 Diary"},"/javazrFA25/finaldiary/finalproject/":{"data":{"":"","#":"","what-does-it-do#What does it do?":"Final Project What does it do? "},"title":"Final Project"}}